## column_selection []
## loc- label based indexing
## iloc- integer label based indexing

In [4]:
import pandas as pd

In [5]:
data3={
    'name':['ankit','sachin','sourav'],
    'age':[24,25,32],
    'profession':['sde','data','training']
}

In [8]:
df=pd.DataFrame(data3)

In [26]:
df.loc[0]

name          ankit
age              24
profession      sde
Name: 0, dtype: object

In [15]:
df.loc[[0,2],['name','age']]

     name  age
0   ankit   24
2  sourav   32

In [18]:
df.loc[0:1]

     name  age profession
0   ankit   24        sde
1  sachin   25       data

In [23]:
df.loc[df['age']>24,['name','profession']]

     name profession
1  sachin       data
2  sourav   training

In [24]:
df

     name  age profession
0   ankit   24        sde
1  sachin   25       data
2  sourav   32   training

In [27]:
df.iloc[0]

name          ankit
age              24
profession      sde
Name: 0, dtype: object

In [29]:
df.iloc[[0,1],[0,1]]

     name  age
0   ankit   24
1  sachin   25

In [30]:
df.loc[0,'name']
df.iloc[0,0]

'ankit'